[[Лабы по сетям]]
### Топология 

![[Pasted image 20241204115111.png]]

### Адресация

#### Указываем ip так, чтобы все pc оказались в одной:

``` shell
PC1> ip 192.168.136.1/23
```

``` shell 
PC2> ip 192.168.136.2/23
```

``` shell
PC3> ip 192.168.137.1/23
```

``` shell 
PC4> ip 192.168.137.2/23
```

#### Настройка коммутатора: 

Включаем передачу пакетов между L3 интерфейсами:
``` shell
SW1> conf t 
SW1(config)> ip routing
```

Настройка fast ethernet 0/0:
``` shell
SW1> conf t 
SW1(config)> int f0/0
SW1(config-int) ip add 192.168.136.254 255.255.255.0
SW1(congig-int) no sh
```

Сохранение конфигурации:
``` shell
SW1(config) write memory
```

#### Просмотр информации интерфейса:

``` shell
SW1> sh ip int f0/0
```

Вывод этой команды показывает состояние интерфейса **Fa0/0** и включает:
- IP-адрес и маску, назначенные интерфейсу.
- Состояние протоколов (включен или выключен).
- Настройки, связанные с ARP:
    - **Proxy ARP:** Включен или выключен (по умолчанию включен на интерфейсах Cisco).
    - Указание на использование маршрутизатором ARP для устройств в этой подсети.

Пример вывода для интерфейса:
``` 
FastEthernet0/0 is up, line protocol is up
Internet address is 192.168.136.1/24
Proxy ARP is enabled
ICMP redirects are always sent
IP fast switching is enabled
```

#### Посмотреть содержимое ARP пакета:

``` shell 
> sh arp
```
#### Очистить ARP таблицу:

``` shell
> clear arp
```
#### Изменить поведение маршрутизатора относительно ARP трафика:

##### Для отключения Proxy ARP:
``` shell
SW1> conf t
SW1(conf)> int f0/0
SW1(conf-if)> no ip proxy-app
```

Теперь маршрутизатор не будет отвечать на ARP-запросы для устройств за пределами своей локальной сети.

### Вопросы:

#### Какая максимальная маска нужна чтобы все PC оказались в одной подсети?

Для того чтобы все узлы (PC1, PC2, PC3, PC4) находились в одной сети, необходимо выбрать минимально возможную подсеть, охватывающую их IP-адреса из обеих сетей: 192.168.136.0/24 и 192.168.137.0/24.

Эти две подсети можно объединить в одну, увеличив длину маски. При этом:
- **Сеть:** 192.168.136.0
- **Максимальная длина маски, чтобы включить обе подсети:** 23 бита.
    - Сеть 192.168.136.0/23 охватывает диапазон IP-адресов от **192.168.136.0** до **192.168.137.255**.

##### Новая конфигурация:
- **Сеть:** 192.168.136.0/23
- **Диапазон IP-адресов:** 192.168.136.0 – 192.168.137.255
- **Широковещательный адрес:** 192.168.137.255
- **Маска:** 255.255.254.0

#### Смогут ли PC1 и PC2 обмениваться пакетами, если у хостов будет /24 маска?

Да, PC1 и PC2 смогут обмениваться пакетами, так как они находятся в одной подсети — 192.168.136.0/24. Для хостов с одинаковой маской подсети /24 IP-адреса в одной подсети могут обмениваться данными напрямую без необходимости маршрутизации.

#### Смогут ли PC1 и PC3 обмениваться пакетами, если у хостов будет /24 маска?

Нет, PC1 и PC3 не смогут обмениваться пакетами напрямую. Они находятся в разных подсетях:

- PC1 находится в сети 192.168.136.0/24.
- PC3 находится в сети 192.168.137.0/24.

Для обмена данными между этими подсетями требуется маршрутизатор (или другое устройство уровня 3), который сможет выполнять маршрутизацию пакетов между разными сетями.

#### Как ESW1 должен поступать с ARP-запросами?

ESW1 является устройством второго уровня (коммутатором), и его роль заключается в передаче кадров на основе MAC-адресов.

- **Если ARP-запрос предназначен для узла в той же VLAN:** ESW1 отправит этот запрос на все порты в рамках VLAN, за исключением того, с которого пришел запрос (функция "flooding").
- **Если ARP-запрос предназначен для узла в другой подсети (разные VLAN):** Коммутатор не будет обрабатывать запрос, так как ARP-запросы ограничиваются одной подсетью или VLAN. Для работы с различными подсетями необходимо устройство уровня 3 (например, маршрутизатор или Layer 3 Switch).

Таким образом, ESW1 должен ретранслировать ARP-запросы только внутри одной VLAN. Для межсетевого взаимодействия потребуется маршрутизатор.

