[[Лабы по сетям]]

### Топология 
![[Pasted image 20250119000033.png]]
(Для понимания)
![[Lab_11_2.jpg]]

### Адресация
- Разделение сети 192.168.N.0/24 на подсети
Используем маски различной длины для создания подсетей с нужным количеством хостов:

- **2 хоста**:  
    Маска: `/30` (255.255.255.252).  
    Диапазон: `192.168.N.0 - 192.168.N.3`.  
    Доступные адреса: `192.168.N.1 - 192.168.N.2`.
    
- **10 хостов**:  
    Маска: `/28` (255.255.255.240).  
    Диапазон: `192.168.N.16 - 192.168.N.31`.  
    Доступные адреса: `192.168.N.17 - 192.168.N.30`.
    
- **30 хостов**:  
    Маска: `/27` (255.255.255.224).  
    Диапазон: `192.168.N.32 - 192.168.N.63`.  
    Доступные адреса: `192.168.N.33 - 192.168.N.62`.
    
- **60 хостов**:  
    Маска: `/26` (255.255.255.192).  
    Диапазон: `192.168.N.64 - 192.168.N.127`.  
    Доступные адреса: `192.168.N.65 - 192.168.N.126`.
    
- **120 хостов**:  
    Маска: `/25` (255.255.255.128).  
    Диапазон: `192.168.N.128 - 192.168.N.255`.  
    Доступные адреса: `192.168.N.129 - 192.168.N.254`.

Или же можете выбрать другие диапазоны.
![[vlsm.jpg]]

### 2. Настройка петлевых интерфейсов

#### R1 (верхний маршрутизатор) - сеть на 2 хоста
``` bash
R1(config)#interface loopback 1
R1(config-if)#ip address 192.168.N.1 255.255.255.252
R1(config-if)#exit
```
#### R2 (нижний левый маршрутизатор) - сеть на 10 хостов:**
``` bash
R2(config)#interface loopback 1
R2(config-if)#ip address 192.168.N.17 255.255.255.240
R2(config-if)#exit
```
#### R3 (нижний центральный маршрутизатор) - сеть на 30 хостов
``` bash
R3(config)#interface loopback 1
R3(config-if)#ip address 192.168.N.33 255.255.255.224
R3(config-if)#exit
```
#### R4 (нижний правый маршрутизатор) - сети на 60 и 120 хостов:
``` bash
R4(config)#interface loopback 1
R4(config-if)#ip address 192.168.N.65 255.255.255.192
R4(config-if)#exit

R4(config)#interface loopback 2
R4(config-if)#ip address 192.168.N.129 255.255.255.128
R4(config-if)#exit
```
---
### 3. Настройка физических интерфейсов
#### R1 (верхний маршрутизатор):
- **FastEthernet0/0** (соединение с R2):
``` bash
R1(config)#interface FastEthernet0/0
R1(config-if)#ip address 192.168.N.5 255.255.255.252
R1(config-if)#no shutdown
R1(config-if)#exit
```
- **FastEthernet0/1** (соединение с R3):
``` bash
R1(config)#interface FastEthernet0/1
R1(config-if)#ip address 192.168.N.9 255.255.255.252
R1(config-if)#no shutdown
R1(config-if)#exit
```    
- **FastEthernet1/0** (соединение с R4):
``` bash
R1(config)#interface FastEthernet0/2
R1(config-if)#ip address 192.168.N.13 255.255.255.252
R1(config-if)#no shutdown
R1(config-if)#exit
```
#### **R2 (нижний левый маршрутизатор):**
- **FastEthernet0/0** (соединение с R1):
``` bash
R2(config)#interface FastEthernet0/0
R2(config-if)#ip address 192.168.N.6 255.255.255.252
R2(config-if)#no shutdown
R2(config-if)#exit
```
#### **R3 (нижний центральный маршрутизатор):**
- **FastEthernet0/0** (соединение с R1):
``` bash
R3(config)#interface FastEthernet0/0
R3(config-if)#ip address 192.168.N.10 255.255.255.252
R3(config-if)#no shutdown
R3(config-if)#exit
```
#### **R4 (нижний правый маршрутизатор):**
- **FastEthernet0/0** (соединение с R1):
``` bash
R4(config)#interface FastEthernet0/0
R4(config-if)#ip address 192.168.N.14 255.255.255.252
R4(config-if)#no shutdown
R4(config-if)#exit
```
---
### 4. Настройка статической маршрутизации

#### **На R1 (верхний маршрутизатор):**
``` bash
R1(config)#ip route 192.168.N.16 255.255.255.240 192.168.N.6
R1(config)#ip route 192.168.N.32 255.255.255.224 192.168.N.10
R1(config)#ip route 192.168.N.64 255.255.255.192 192.168.N.14
R1(config)#ip route 192.168.N.128 255.255.255.128 192.168.N.14
```
#### **На R2, R3, R4 (нижние маршрутизаторы):**
Настройте дефолтные маршруты для перенаправления всего неизвестного трафика на R1.
- **R2:**
``` bash
R2(config)#ip route 0.0.0.0 0.0.0.0 192.168.N.5
```
- **R3:**
``` bash
R3(config)#ip route 0.0.0.0 0.0.0.0 192.168.N.9
```
- **R4:**
``` bash
R4(config)#ip route 0.0.0.0 0.0.0.0 192.168.N.13
```
---
### 5. Итоговая проверка

- Убедитесь, что все интерфейсы активны (используйте команду `show ip interface brief`).
    
- Проверьте маршруты (используйте команду `show ip route`).
    
- Проверьте связность между петлевыми интерфейсами с помощью `ping`.