[[Лабы по сетям]]

### Топология 

![[Lab_06_1.png]]

### Адресация 

#### Настройка ip адресов интерфейсов маршрутизаторов 
##### R1

``` bash
R1> conf t 
R1(conf)> int f0/0
R1(conf-int)> ip add 192.168.137.1 255.255.255.0
R1(conf-int)> no sh

R1> conf t 
R1(conf)> int f0/1
R1(conf-int)> ip add 192.168.136.1 255.255.255.0
R1(conf-int)> no sh
```
##### R2

``` bash
R2> conf t 
R2(conf)> int f0/0
R2(conf-int)> ip add 192.168.136.254 255.255.255.0
R2(conf-int)> no sh

R2> conf t 
R2(conf)> int f0/1
R2(conf-int)> ip add 192.168.138.1 255.255.255.0
R2(conf-int)> no sh
```

### Настройка пулов на маршрутизаторе

``` bash
R1(conf)> ip dhcp pool POOL136
R1(dhcp-conf)> network 192.168.136.0 255.255.255.0
R1(dhcp-conf)> default-router 192.168.136.1

R1(conf)> ip dhcp pool POOL137
R1(dhcp-conf)> network 192.168.137.0 255.255.255.0
R1(dhcp-conf)> default-router 192.168.137.1

R1(conf)> ip dhcp pool POOL138
R1(dhcp-conf)> network 192.168.138.0 255.255.255.0
R1(dhcp-conf)> default-router 192.168.138.1
```

#Объяснение

`ip dhcp pool POOL_NAME` - задаёт имя пула DHCP (например, POOL1).
`network NET MASK` - определяет сеть и маску.
`default-router GW` - задаёт адрес шлюза (первый адрес в сети).

После этого маршрутизатор будет автоматически выдавать IP-адреса устройствам из указанных сетей.

#### Задать исключения 

``` bash
R1(conf)> ip dhcp exclude-address ip1 [ip2]
```

Где: 
- _ip1_ - исключенный адрес 
- _ip2_ - не обязательный параметр, если указать, то будут исключены все адреса между _ip1_ и _ip2_. 

### Выдача ip адресов

На подключенных устройствах чтобы получить ip по dhcp:

``` bash
PC1> ip dhcp
```

В данный момент PC3 не сможет получить ip адрес, мы не задали **relay-agent**. Для этого нужно указать путь для _192.168.138_-ой сети следующим образом:

``` bash
R1(conf)> ip route 192.168.138.0 255.255.255.0 192.168.136.254
```

Где мы говорим, что _138-ую сеть_ на _24 маске_ будем прокидывать через _192.168.136.254 адрес_ (Шлюз через который мы подключены ко второму маршрутизатору). Не забываем сообщить об этом другому маршрутизатору:

``` bash
R2(conf)> int f0/1
R2(conf-int)> ip helper-address 192.168.136.1
```

Указываем шлюз через который мы подключены к первому маршрутизатору. Теперь на PC3 можно получить ip адрес через настроенный dhcp pool.

### Обеспечение полной связанности. 

На данный момент ситуация следующая: 
- PC1 не видит _138_-ую сеть.
- PC2 видит всех.
- PC3 не видит _136_ и _137_ сети.

Чтобы исправить ситуацию надо настроить роутинг для R2 маршрутизатора.

``` bash
R2(config)> ip route 192.168.136.0 255.255.255.0 192.168.136.1
R2(config)> ip route 192.168.137.0 255.255.255.0 192.168.136.1
```

После данной настройки мы обеспечили полную связанность нашей топологии.

### Полезные команды

- Просмотр всех настроенных путей. 
``` bash
R1> sh ip route
```

- Просмотр базы аренд.
``` bash
R1> sh ip dhcp bind 
```

- Сброс базы аренд:
``` bash
R1> clear ip dhcp binding *
```

- Просмотр текущей настройки пулов.
``` bash
R1> sh running-config | section ip dhcp pool
```

- Просмотр текущей настройки исключения ip адресов
``` bash 
R1> sh running-config | include ip dhcp excluded-address
```

- Для сохранения конфигураций на маршрутизаторе:
``` bash 
R1> write memory
```

