"Cетевые воины" Маршрутизаторы наносят 
ответный удар
[[Лабы по сетям]]

### Топология 
![[Снимок экрана 2025-01-14 165816.png]]

### Адресация 
#### Пкашки:
- PC1 и PC3 - Vlan N
- PC2 и PC4 - Vlan 2N
#### Коммутатор:
- Раскидывает два vlan-а
- Соединен c  маршрутизатором и помогает раздавать ip
#### Маршрутизатор: 
- Держит два dhcp пула f0/0

Прикол этой лабы что делаем ту же 9.1 ток без транка.

### Настройка
#### Маршрутизатор
##### R1 f0/0 ставим ip
``` bash 
R1(conf)# int f0/0
R1(config-int)# ip add 10.0.N.1 255.255.255.252
R1(config-int)# no sh
```
##### Настраиваем dhcp пулы
``` bash 
R1(conf)# ip dhcp pool VLAN_N
R1(dhcp-config)# network 102.168.N.0 255.255.255.128
R1(dhcp-config)# default-router 192.168.N.126

R1(conf)# ip dhcp pool VLAN_2N
R1(dhcp-config)#network 102.168.N.128 255.255.255.128
R1(dhcp-config)# default-router 192.168.N.254
```
##### Настройка исключений
``` bash 
R1(conf)# ip dhcp excluded-address 192.168.N.126
R1(conf)# ip dhcp excluded-address 192.168.N.254
```
##### Сразу роутинг пропишем
``` bash
R1(conf)# ip routing 192.168.N.0 255.255.255.0 10.0.N.2
```
#### Коммутатор
##### Создание VLAN N и 2N
``` bash
(config)#vlan N
(config-vlan)#name VLAN-N
(config-vlan)#exit
(config)#vlan 2N
(config-vlan)#name VLAN-2N
(config-vlan)#exit
```
##### Назначение портов VLAN N
``` bash
(config)#interface fastEthernet 1/1
(config-if)#no sh
(config-if)#switchport mode access
(config-if)#switchport access vlan N
(config-if)#exit
(config)#interface fastEthernet 1/3
(config-if)#no sh
(config-if)#switchport mode access
(config-if)#switchport access vlan N
(config-if)#exit
```
##### Назначение портов VLAN 2N
``` bash
(config)#interface fastEthernet 1/2
(config-if)#no sh
(config-if)#switchport mode access
(config-if)#switchport access vlan 2N
(config-if)#exit
(config)#interface fastEthernet 1/4
(config-if)#no sh
(config-if)#switchport mode access
(config-if)#switchport access vlan 2N
(config-if)#exit
```
##### Надо интерфейс f1/0 сделать L3 уровня и настроить ему ip
``` bash
SW1(conf)# int f1/0
SW1(config-int)# no switchport
SW1(config-int)# ip add 10.0.N.2 255.255.255.252
SW1(config-int)# no sh
```
##### Настройка SVI's 
``` bash
SW1(config)# int vlan N
SW1(config-int)# ip add 192.168.N.126 255.255.255.128
SW1(config-int)# ip helper-address 10.0.N.1

SW1(config)# int vlan 2N
SW1(config-int)# ip add 192.168.N.254 255.255.255.128
SW1(config-int)# ip helper-address 10.0.N.1
```
##### Включаем dhcp и роутинг
``` bash
SW1(conf)# servvice dhcp
SW1(conf)# ip routing
```

### Вывод 

Мы избавились от транкового порта и прокидываем пакеты без тегирования на линке SW1-R1.



