"Сетевые воины" Месть коммутаторов
[[Лабы по сетям]]

### Топология 
![[Pasted image 20250114023925.png]]

### Адресация 
#### Пкашки:
- PC1 и PC3 - Vlan N
- PC2 и PC4 - Vlan 2N
#### Коммутатор:
- Раскидывает два vlan-а
- Соединен по транк интерфейсу с маршрутизатором R1
- Доступ по N vlan для R2
- Доступ по 2N vlan для R3
#### Маршрутизаторы: 
- R2 и R3 держат два dhcp пула распополамив 192.168.N.0 сеть
- R1 по транку перекидывает Arp запросы из vlan-а в vlan

### Настройка
#### Маршрутизаторы
##### На R1  настраиваем trunk с сабинтерфейсами
``` bash
R1> enable
R1# configure terminal
R1(config)# interface e0/0.N
R1(config-subif)# encapsulation dot1Q N
R1(config-subif)# ip address 192.168.N.126 255.255.255.128
R1(config-subif)# exit
R1(config)# interface e0/0.2N
R1(config-subif)# encapsulation dot1Q 2N
R1(config-subif)# ip address 192.168.N.254 255.255.255.128
R1(config-subif)# exit
```
##### На R2 (vlan N) включаем интерфейс и настраиваем dhcp 
``` bash
R2# configure terminal
R2(config)# interface f1/0
R2(config-if)# ip address 192.168.N.1 255.255.255.128
R2(config-if)# no shutdown
R2(config-if)# exit

R2(config)# ip dhcp pool VLAN-N
R2(dhcp-config)# network 192.168.N.0 255.255.255.128
R2(dhcp-config)# default-router 192.168.N.1
R2(dhcp-config)# exit
R2(config)# ip dhcp excluded-address 192.168.N.1
R2(config)# ip dhcp excluded-address 192.168.N.126
```
##### На R3 (vlan 2N) включаем интерфейс и настраиваем dhcp 
``` bash
R3# configure terminal
R3(config)# interface f1/1
R3(config-if)# ip address 192.168.N.129 255.255.255.128
R3(config-if)# no shutdown
R3(config-if)# exit

R3(config)# ip dhcp pool VLAN-2N
R3(dhcp-config)# network 192.168.N.128 255.255.255.128
R3(dhcp-config)# default-router 192.168.N.129
R3(dhcp-config)# exit
R3(config)# ip dhcp excluded-address 192.168.N.129
R3(config)# ip dhcp excluded-address 192.168.N.254
```
##### Proxy-ARP
``` bash
R2(config)# interface f1/0
R2(config-if)# ip proxy-arp
R2(config-if)# exit

R3(config)# interface f1/1
R3(config-if)# ip proxy-arp
R3(config-if)# exit
```
##### Настройка маршрутов (без этого запросы не кидались между vlan-ами)
На R2:
``` bash
R2(config)# ip route 192.168.136.128 255.255.255.128 192.168.136.126
```
На R3:
``` bash
R3(config)# ip route 192.168.136.0 255.255.255.128 192.168.136.254
```
#### Коммутатор
##### Создание vlan-ов
``` bash
SW1> enable
SW1# configure terminal
SW1(config)# vlan N
SW1(config-vlan)# name VLAN-N
SW1(config-vlan)# exit
SW1(config)# vlan 2N
SW1(config-vlan)# name VLAN-2N
SW1(config-vlan)# exit
```
##### Для каждой VPC настраиваем нужный vlan
``` bash
SW1(config)# interface range fx/y
SW1(config-if-range)# switchport mode access
SW1(config-if-range)# switchport access vlan N/2N
SW1(config-if-range)# exit
```
##### Trunk для R1
``` bash
SW1(config)# interface f1/0
SW1(config-if)# switchport mode trunk
SW1(config-if)# exit
```

### Q&A

#### Как идут пинги через разные vlan (PC1 -> PC2)
##### **Топология**
- **PC1** (VLAN 136) → **SW1** → **R2** → **R1** → **R3** → **SW1** → **PC2** (VLAN 137).
---
##### **Шаги передачи пакета**

###### 1. **PC1 отправляет пакет на PC2**

- **PC1** (IP: `192.168.136.2`) хочет отправить пакет на **PC2** (IP: `192.168.136.130`).

- **PC1** проверяет, находится ли **PC2** в той же сети:
    - Сеть **PC1**: `192.168.136.0/25` (маска `255.255.255.128`).
    - Сеть **PC2**: `192.168.136.128/25` (маска `255.255.255.128`).

- Поскольку **PC2** находится в другой сети, **PC1** отправляет пакет на шлюз по умолчанию (если он настроен). В вашем случае шлюз не настроен, поэтому **PC1** использует ARP-запрос для поиска MAC-адреса **PC2**.
---
###### 2. **ARP-запрос от PC1**

- **PC1** отправляет ARP-запрос: "Кто такой `192.168.136.130`?".

- Поскольку **PC2** находится в другой VLAN, коммутатор **SW1** не передает ARP-запрос в VLAN 137.

- Маршрутизатор **R2** (интерфейс `f1/0) видит ARP-запрос и, если **ARP-proxy** включен, отвечает своим MAC-адресом.
---
###### 3. **R2 обрабатывает ARP-запрос**

- **R2** проверяет, знает ли он маршрут до сети `192.168.136.128/25` (VLAN 137).

- Если маршрут есть, **R2** отвечает на ARP-запрос своим MAC-адресом.

- **PC1** получает ответ и отправляет пакет на MAC-адрес **R2**.

---

###### 4. **R2 передает пакет на R1**

- **R2** получает пакет от **PC1** и проверяет таблицу маршрутизации.

- **R2** видит, что сеть `192.168.136.128/25` доступна через **R1** (интерфейс `e0/0` с IP `192.168.136.126`).

- **R2** отправляет пакет на **R1**.

---

###### 5. **R1 передает пакет на R3**

- **R1** получает пакет от **R2** и проверяет таблицу маршрутизации.

- **R1** видит, что сеть `192.168.136.128/25` доступна через **R3** (интерфейс `e0/0` с IP `192.168.136.254`).

- **R1** отправляет пакет на **R3**.

---

###### 6. **R3 передает пакет на PC2**

- **R3** получает пакет от **R1** и проверяет таблицу маршрутизации.

- **R3** видит, что сеть `192.168.136.128/25` доступна через интерфейс `f1/1`.

- **R3** отправляет ARP-запрос в VLAN 137, чтобы узнать MAC-адрес **PC2**.

- **PC2** отвечает на ARP-запрос, и **R3** отправляет пакет на **PC2**.